{"BRC-20":{"title":"BRC-20","links":[],"tags":[],"content":"BRC-20 标准是一个实验性的可替代代币标准，专门为比特币区块链设计。它不同于 ERC-20 标准，不依赖智能合约，而是使用序数铭记。序数铭记是一种将数据（如 JSON）铭记在比特币上的协议。与 ERC-20 等标准不同，BRC-20 标准使用 JSON 铭记来编程比特币。这些带有铭记的比特币被称为序数，它们是非同质化的，并与非同质化代币（NFT）具有相似之处。BRC-20 代币的一个重要特点是它们是可替代的，这意味着它们是可以互换的，具有相等的价值。\nBRC-20 标准的优点包括：\n\n与比特币网络兼容：BRC-20 标准能够与比特币区块链无缝集成，利用其强大的网络和广泛的接受度。\n简单易用：BRC-20 标准采用简化的代币化机制，无需复杂的智能合约，使其易于使用。\n安全性：BRC-20 标准借助比特币区块链的安全机制，具有出色的安全性。\n增长潜力：随着越来越多的项目采用 BRC-20 标准，创新和新的应用案例将不断涌现，吸引开发者、投资者和用户的关注。\n\nBRC-20 标准的局限性包括：\n\n缺乏智能合约功能：与其他标准（如 ERC-20）不同，BRC-20 标准不支持智能合约，这可能限制了其在某些领域的能力。\n依赖比特币区块链：BRC-20 标准依赖比特币区块链，这使其受到网络固有的限制，如低可扩展性和较慢的交易速度的影响。\n有限的互操作性：BRC-20 标准仅适用于比特币区块链生态系统，这可能导致在使用其他区块链系统时存在互操作性挑战。\n有限的实用性：BRC-20 标准主要用于可替代资产的代币化，不适用于非同质化资产的代币化或实现复杂的代币功能。\n\n总体而言，BRC-20 标准在比特币区块链上的应用前景取决于区块链行业和代币经济动态的发展。然而，由于 BRC-20 标准仍处于实验阶段，BRC-20 代币目前还不被视为投资对象，需要谨慎对待。\n\n\nWhat is a BRC-20 token standard: An Overview\nBRC-20 Explained: How Bitcoin Tokens Work and the Controversy Around Them\nWhat Are BRC-20 Tokens? | Ledger\n"},"BRC-420":{"title":"BRC-420","links":[],"tags":[],"content":"BRC-420是一个有趣的实验，通过递归定义更复杂的资产格式，例如游戏物品、动画和效果，或者元宇宙中的游戏模块。这些格式将是完全开源的，允许任何人创建自己的“元宇宙铭记”。在后面的章节中，我们将展示2D、3D和其他铭记格式，并确保更多的游戏平台和游戏引擎可以支持它们。\n此外，BRC-420 在单一铭文的基础上建立了使用权和版税之间的约束关系。当您拥有铭文时，您可以分配其使用权并为其设定价格。“使用权”可以理解为其他用户在Ordinals Space中使用您的音乐、模型、脚本、游戏玩法等的权限。它也可以解释为购买某些特权，例如加入您的组织或俱乐部。\nBRC-420 为 Ordinals 的链上游戏和模块化区块链开辟了可能性。不同的创作者可以贡献不同的模块，新的创作者可以在前人的创新基础上进行创新。这导致了 Ordinals 生态系统内各种创新的激增，使所有相关人员受益。"},"BitVM":{"title":"BitVM","links":[],"tags":[],"content":"BitVM 是由ZeroSync的Robin Linus设计的一种新的optimistic rollup + fraud proof + Taproot Leaf + Bitcoin Script计算范式。BitVM 提供了一个计算框架，允许在 Bitcoin 上执行复杂的合约，而不改变其核心原则。它是比特币虚拟机，可以被理解为 Bitcoin 宇宙中的一个安全、封闭的领域，允许执行任何程序或智能合约。\nBitVM 的机制采用了简单但强大的结构，包括两个关键实体：Prover 和 Verifier。Prover 发起计算，而 Verifier 验证其合法性。这种双系统确保结果既可靠又一致。BitVM 的智慧在于其链下计算策略。与传统的区块链不同，BitVM 外部加载了大多数要求严格的计算，节省了 Bitcoin 区块链上的空间，提高了速度，并削减了成本。但当争议出现时，BitVM 会使用 “Fraud Proofs” 转向链上验证，确保没有任何虚假的声明被忽视。\nBitVM 的主要吸引力是其支持高级和多样化合约的能力。用户现在不仅可以参与货币合约，而且可以利用它们运行复杂的 Decentralised Applications (DApps)，如策略游戏或任何当前的 Web3 DApp。此外，BitVM 的结构使得创建真正的去中心化预测领域成为可能，从而扩大了 Bitcoin 智能合约的范围。\n尽管有其优点，但了解 BitVM 的局限性也是必要的。其当前的设计偏向于两方互动，限制了其在多方环境中的使用。随着 Decentralised Finance (DeFi) 变得越来越复杂，这一约束可能会妨碍 BitVM 的相关性。此外，链下计算的要求可能会对没有足够计算资源的用户或那些参与多个 BitVM 合约的用户造成负担。然而，随着 BitVM 的成长，有潜力解决这些障碍，并通过演变和适应成为 Bitcoin 相关交易和合约的关键工具。\n\nLearn more:\n\n关于BitVM你需要知道的一切 - 金色财经\n图说｜四张图详解BitVM是什么？ - BlockBeats\n什么是 BitVM，比特币智能合约的关键一步 | TokenInsight\n"},"Bridge":{"title":"Bridge","links":[],"tags":[],"content":"Bridge 是一种区块链互联技术，它可以实现不同区块链之间的数据和价值的传输。Bridge 的作用是连接不同的区块链网络，使它们可以互相交互和协作，从而提高 Web3 的互操作性和多样性。\nBridge 的原理是，通过一些中继节点或者智能合约，将一条区块链上的事件或者交易转换为另一条区块链上的证明或者触发器，从而实现跨链通信。\nBridge 可以分为两种类型：中心化的 Bridge 和去中心化的 Bridge。\n\n\n中心化的 Bridge 是指由某个中心化的实体或者机构来管理和运营的 Bridge，例如交易所或者托管服务。中心化的 Bridge 的优点是速度快、成本低、易于使用，但缺点是安全性和可信度较低，可能存在审查或者滥用的风险。\n\n\n去中心化的 Bridge 是指由多个分散的节点或者合约来共同维护和验证的 Bridge，例如联盟链或者侧链。去中心化的 Bridge 的优点是安全性和可信度较高，符合 Web3 的理念，但缺点是速度慢、成本高、难度大。\n\n\n针对 Bridge 的攻击 §\nBridge 攻击是指利用跨链协议的漏洞或者恶意篡改验证节点的私钥来窃取加密货币的行为。这种攻击在2022年非常流行，造成了超过20亿美元的损失。一些著名的Bridge 的攻击案例有：\n\n\nRonin Bridge：这是有史以来最大的DeFi攻击，据称是由朝鲜的Lazarus Group发起的。他们通过钓鱼邮件的方式获取了Ronin，一个为NFT游戏Axie Infinity构建的ETH侧链的四个验证节点的私钥，从而窃取了超过173,600个以太币和25.5百万美元的USDC，总价值超过6亿美元。\n\n\nWormhole Bridge：这是一个跨链协议，允许用户在Solana、Ethereum、Binance Smart Chain和Terra之间转移资产。在10月份，黑客利用了Wormhole Bridge的一个漏洞，通过伪造签名来欺骗验证节点，从而盗走了价值3.26亿美元的代币。\n\n\nNomad Bridge：这是一个允许用户在Ethereum和Nomad之间转移资产的协议。Nomad是一个基于Cosmos的区块链，专注于跨链游戏。在7月份，黑客利用了Nomad Bridge的一个逻辑错误，通过重复提交同一个交易来获取多份债务代币，从而盗走了价值1.5亿美元的代币。\n\n\nBridge 的攻击的主要原因是跨链协议的复杂性和缺乏安全经验。跨链协议需要结合多种结构，如托管人、债务发行人和预言机，这为黑客提供了多种攻击途径。此外，跨链协议还面临着51%攻击、重放攻击、前端攻击等威胁。为了防止桥的攻击，需要采取一些措施，如：\n\n增加验证节点的数量和多样性，以提高网络的去中心化程度和安全性。\n使用多重签名或者门限签名技术，以防止单个验证节点的私钥被泄露或者滥用。\n对跨链协议进行严格的安全审计和测试，以发现和修复潜在的漏洞和错误。\n提高用户的安全意识和教育，以避免点击可疑的链接或者下载恶意的软件。\n使用可信的第三方服务，如Cloudflare，来保护跨链协议的前端和后端，以防止DDoS攻击、网络劫持、数据篡改等。\n"},"Circuit":{"title":"Circuit","links":[],"tags":[],"content":"Circuits 是一种约束集合，如果满足这些约束，就可以证明计算是正确执行的。ZK 中的 circuits 有时也被称为算术电路，因为电路中的“门”是有限域上的加法和乘法操作。\n在 ZK 中，电路的作用是用来验证零知识证明。具体来说，两个参与方共享电路 C 的描述、输出值 y 和可能的一些输入值 x₁,…,xₗ。然后，证明者向验证者证明他们知道额外的秘密输入 s₁,…,sₙ，使得如果将电路 C 在输入 x₁,…,xₗ,s₁,…,sₙ上进行计算，结果将是 y。也就是说，C(x₁,…,xₗ,s₁,…,sₙ) = y。知识的论证属性保证了证明者必须实际上知道这些输入才能说服验证者。零知识属性保证了验证者除了上述陈述是真实的之外，不会从交互中获得任何信息。特别是，验证者对 s₁,…,sₙ不会获得任何信息。\n\nConsensys/gnark: gnark is a fast zk-SNARK library that offers a high-level API to design circuits. The library is open source and developed under the Apache 2.0 license"},"DeFi":{"title":"DeFi","links":[],"tags":[],"content":"DeFi（Decentralized Finance）是去中心化金融的缩写。它是加密货币领域的一部分，旨在构建一个基于区块链的全新互联网金融系统，通过替代传统的中介机构和信任机制来实现。\n什么是DeFi？ §\nDeFi是指使用区块链技术来替代传统中介机构和信任机制的加密货币领域的一部分。它旨在建立一个去中心化的金融系统，使人们可以直接进行交易和金融活动，而无需依赖银行或证券交易所等中介机构。\nDeFi的工作原理是什么？ §\nDeFi使用与加密货币相同的区块链技术。区块链是一个分布式和安全的数据库或账本，通过称为dApps的应用程序来处理交易并运行区块链。交易被记录在区块中，并由其他用户进行验证。如果验证者对交易达成一致意见，该区块将被关闭和加密，然后创建另一个包含前一个区块信息的区块。这些区块通过每个后续区块中的信息链接在一起，形成了所谓的区块链。区块链中的先前区块的信息无法更改，否则将影响到后续区块，因此区块链是不可篡改的。这种概念以及其他安全协议提供了区块链的安全性。\nDeFi的用途有哪些？ §\nDeFi的核心理念之一是点对点（P2P）金融交易。P2P DeFi交易是指两个当事人在没有第三方参与的情况下，同意以加密货币交换商品或服务。除此之外，DeFi还可以用于点对点借贷、预测市场、期权和衍生品等金融活动。\nDeFi的优势和劣势是什么？ §\nDeFi的优势包括去中心化、低费用、高灵活性、更广泛的金融服务可访问性以及更大的个人资金控制权。然而，DeFi也存在一些劣势，包括缺乏监管、安全风险、技术问题和不稳定性等。\nDeFi的未来如何？ §\nDeFi是一个不断发展的领域。目前，它尚未受到完全的监管，并且其生态系统存在基础设施问题、黑客攻击和欺诈等风险。对于这种类型的监管，存在一些重要问题，例如如何调查跨境、跨协议和跨DeFi应用程序的金融犯罪，谁将执行监管规定以及如何执行等。此外，还存在系统稳定性、能源需求、碳足迹、系统升级、系统维护和硬件故障等问题。\n总结和展望 §\nDeFi是一个正在崛起的金融技术，挑战着当前的中心化银行体系。它通过消除使用金融服务时银行和其他金融公司收取的费用，促进了点对点交易。然而，投资加密货币和其他ICO（首次代币）DeFi（去中心化金融）是指建立一个新的、基于互联网的金融系统的加密货币领域的一部分。它使用区块链技术来取代传统的中介机构和信任机制，实现去中心化的金融交易和服务。DeFi的目标是挑战当前的中心化银行体系，消除银行和其他金融公司对使用其服务收取的费用，并推动点对点（P2P）交易的使用。\nDeFi与传统的中心化金融机构和银行有所不同。在传统金融中，资金由银行和第三方机构持有，这些机构促进各方之间的资金流动，并对使用其服务收取费用。而在DeFi中，中间人被软件取代。人们直接与彼此进行交易，区块链上的“智能合约”负责市场交易、结算交易，并确保整个过程公平和可信。\nDeFi不仅包括加密货币交易所（类似于股票交易所），还包括借贷平台、预测市场、期权和衍生品等金融工具。实际上，加密货币领域的人们正在建立自己的华尔街，这个华尔街在很大程度上是去中心化的，专门处理加密货币，并且没有太多的繁文缛节和监管规定。\nDeFi的总锁定价值（Total Value Locked，TVL）是衡量DeFi项目中锁定的加密货币价值的一种标准。根据DeFi Pulse的数据，目前DeFi的TVL约为770亿美元，如果DeFi是一家银行，它将成为美国存款规模排名第38位的银行。\n人们对DeFi的担忧主要是因为它大部分是无监管的，缺乏传统金融体系中存在的消费者保护和安全措施。例如，稳定币就是一个例子。稳定币是一种加密货币，其价值与政府支持的货币（如美元）的价值挂钩。在传统金融体系中，稳定币可能受到监管，但在DeFi中却没有类似的监管。\n总之，DeFi是一个新兴的金融技术，旨在挑战当前的中心化银行体系。它通过去中心化的金融交易和服务，消除了银行和其他金融公司对使用其服务收取的费用，并促进了点对点交易。\n\n\nWhat Is Decentralized Finance (DeFi) and How Does It Work?\nWhat is DeFi? - The New York Times\nThe Technology of Decentralized Finance (DeFi)\n"},"Eclipse-Attacks":{"title":"Eclipse Attacks","links":["区块链攻击"],"tags":[],"content":"Eclipse attack是一种基于P2P（点对点）网络的攻击，目的是将目标节点与网络中的其他节点隔离，从而控制目标节点的信息获取和传输。Eclipse attack只能针对接受其他节点的入站连接的节点进行，而不是所有节点都接受入站连接。在比特币网络中，每个节点默认最多有117个入站TCP连接和8个出站TCP连接。\nEclipse attack的工作原理是，攻击者利用自己控制的节点或者僵尸网络，向目标节点发送大量的IP地址，使目标节点在重启或重新连接时优先选择这些IP地址。然后，攻击者就可以拦截目标节点的所有入站和出站连接，向目标节点提供虚假或过时的区块链数据，或者阻止目标节点与真实网络中的其他节点通信。\nEclipse attack的后果可能有以下几种：\n\n\n双花攻击：攻击者可以利用Eclipse attack向目标节点展示一个错误的区块链状态，从而在同一笔资金上进行两次或多次支付。例如，攻击者可以向一个商户支付一笔未经确认的交易，然后在真实网络中用同样的资金支付给另一个人。如果攻击者的交易手续费更高，那么矿工会优先打包攻击者的交易，导致商户的交易无效。或者，攻击者可以向一个商户支付一笔经过多次确认的交易，但是这些确认是在被隔离的网络中进行的，而不是真实网络中。当商户的节点重新加入真实网络后，他们会发现自己的交易被孤立了，因为真实网络中有一个更长的有效链。\n\n\n矿工算力损失：攻击者可以利用Eclipse attack削弱目标节点的挖矿能力，从而获得相对优势。例如，攻击者可以向目标节点展示一个落后的区块链状态，使目标节点在无效的区块上浪费算力。或者，攻击者可以向目标节点隐藏最新的区块，使目标节点无法及时更新自己的区块链状态，从而降低目标节点获得下一个区块的概率。\nEclipse attack的防范措施有以下几种：\n\n\n选择可信的节点连接：节点可以选择只连接到一些已知的可信节点，例如白名单中的IP地址，从而避免被恶意节点欺骗。但是，这种方法可能会降低网络的去中心化程度，因为新节点可能无法加入网络。\n\n\n随机选择新连接：节点可以在每次重启或重新连接时，随机选择一些新的出站连接，从而减少被恶意节点占据的可能性。这种方法可以提高Eclipse attack的成本，因为攻击者需要不断地刷新自己的IP地址，以保持对目标节点的控制。\n\n\n增加地址的存储空间：节点可以增加自己存储的IP地址的数量，从而增加自己连接到真实网络的机会。这种方法也可以提高Eclipse attack的成本，因为攻击者需要提供更多的IP地址，以覆盖目标节点的存储空间。\n总之，Eclipse attack是一种基于P2P网络的攻击，可以用于实施双花攻击或者\n\n"},"Gas":{"title":"Gas","links":["以太坊"],"tags":[],"content":"在Web3领域中，Gas是一种衡量和支付区块链交易成本的单位。\n它主要与以太坊（Ethereum）网络相关，但也适用于其他基于区块链技术的平台。Gas的概念源自以太坊的设计，用于解决网络拥堵和滥用的问题。\nGas: 总体概念 §\nGas是以太坊网络上的计算单位，类似于时间单位的秒和距离单位的米。在以太坊上执行交易需要一定的计算资源，而Gas就是衡量这些计算资源所需的数量。每笔交易都需要支付一定的费用，通常称为Gas费用或交易费用，这些费用以以太坊的本地货币ETH支付。\nGas的计算方式 §\n在以太坊的伦敦升级之前，Gas费用的计算方式是通过一个简单的公式来确定的：Gas费用 = 消耗的Gas数量 * Gas价格。其中，消耗的Gas数量是执行交易所需的Gas总量，而Gas价格是每个Gas单位所支付的以太币数量。\nGas价格以gwei计价，是以太币的计价单位。1 Gwei等于0.000000001 ETH，而1 ETH等于10^9 Gwei。因此，Gas价格可以表示为1 Gwei，而不是0.000000001 ETH。\nGas限制、退还机制 §\n除了用户指定的每笔交易的Gas限制外，以太坊网络还对单个区块中允许的最大Gas数量施加了限制。这是为了确保每个区块的计算成本在可接受范围内。如果交易使用的Gas超过了用户设置的Gas限制，交易将失败并且Gas将消失。而如果交易使用的Gas少于Gas限制，未使用的Gas将退还到用户的账户中。\n伦敦升级后的Gas费用计算 §\n在以太坊的伦敦升级之后，Gas费用的计算方式略有不同。该升级引入了更好的Gas费用估算和更快的交易确认时间。具体的计算方式和改进可以参考相关的技术文档和升级说明。"},"Layer2":{"title":"Layer2","links":["Layer2","通道","Rollup","Plasma","侧链"],"tags":[],"content":"Layer-1 是用于描述底层主区块链架构的术语， Layer2 是位于底层主区块链 Layer1 之上的叠加网络。\n之所以被称为Layer2，是因为它们没有写入影响 Layer1 的代码中。\n以比特币和闪电网络为例。比特币是 Layer1 网络，而闪电网络是Layer2。\n再以以太坊为例，Plasma、Polygon 等是 Layer 2。Layer2扩展解决方案不需要在 Layer1 中进行更改。它可以使用现有元素（例如智能合约）构建在 Layer1 之上。\n第 2 层扩展解决方案通过处理链下交易来帮助提高第 1 层的能力。可以改进的两个主要功能是事务速度和事务吞吐量。例如，以太坊目前可以在其基础/主链第 1 层上每秒处理大约 15 笔交易。以太坊 2.0 已经在一定程度上扩展了以太坊 1.0 区块链。它使用权益证明和分片，增加了第 1 层的交易吞吐量。但第 2 层扩展解决方案可以使以太坊 2.0 每秒处理数十万笔交易。\n最重要的是，第 2 层解决方案可以大大降低交易费用（以太坊区块链中的 gas 费用）。\n扩展解决方案可分为 4 类：\n\nChannels\nroll-ups\nPlasma\nSidechains.\n"},"Merkle树":{"title":"Merkle树","links":[],"tags":[],"content":"数据完整性是通信协议需要考虑的基本问题之一。 数据存储于硬盘中、将在网络中传输,应时时刻刻保证数据的完整性。区块链程序更是如此。\n如果一组数据量不大的话,例如我们有 a_1、 a_2、 a_3 三个数据要传输, 发送方可以用串联数据片段并执行哈希,得到一个校验值 h,如下所示。\nh = {hash}(a_1 + a_2 + a_3)\n在收到数据后,接收方进行相同形式的串联,并按同样的哈希函数计算,比较哈希值是否一致就可知数据是否完整。\nh&#039; = {hash}(a_1 + a_2 + a_3)\n但这个思路存在一定的效率问题 §\n在于当数据量比较大时候,例如有 a_1、 a_2、 a_3 … a_{100} 的数据片段的时候, 我们往往分批传输这些小块,每次只要有一小部分数据损坏,整个数据校验和便无法对应上, 我们也不知道过程中哪个小块错误了,导致我们重传整组数据,这是非常耗时的。 如果能将数据进一步细分成小组,对小组做校验和,再将小组与小组组合成大组做校验和,将能方便地解决上述问题。\nMerkle树是一个在密码学中常使用的树形结构,适用于解决数据完整性问题。 它的结构功能异常简单,通常我们用二叉树的形式来表示一棵 Merkle树, 它存在的作用是数据分组并保证数据在存储中的完整性。 例如一棵包含了数字 1 到 8 的 Merkle二叉树,如图 4-4_ 所示。\n\n在图中的 Merkle树里,我们一共持有8个基础数据, “1” 到 “8” ,它们两两分组形成最初的小组。\n例如数据 “1” 与数据 “2” ,它们分在一组中,并计算它们串联后的哈希值 H_{1}={hash}(1,2) ,\n同理将数据 “3” 与数据 “4” 串联的串联哈希值计算为 H_2,依次类推,形成第二层的树中节点。\n之后再将第二层的树中节点\\ H_1~\\ ~ \\ H_4\\ 两两分组。例如 (\\ H_1\\ 与\\ H_2\\ 串联计算第三层的哈希值\\ H_5\\ )。逐层聚合反复递归,执行哈希计算。直到的仅剩下一个哈希值节点:根节点哈希值 Root ,该过程完毕。\n如果碰上基础数据集不是偶数个元素(例如仅有7个数据),则复制一个元素,让它与自己的双胞胎做哈希运算。\n由此我们可以推论:Merkle树的树叶都是数据、树中的节点都是哈希值。\n那么,Merkle树如何提升了校验效率呢? §\nMerkle树的精妙在于它将一个庞大的数据集分散成组。\n在网络传输的过程中,仅需逐步传送各个小组,并执行组合校验,再逐步传送,直到拼接完成整个数据集。过程中若有任何数据传送出差错,仅需重传那个小分组。如果数据集中的一个值在传输中被损毁,会影响该数据所在的整个分支、子树、到根节点的哈希值,方便我们快速定位出错点。如图 4-5_ 所示,我们修改数据4为44后,相应路径直到根节点哈希都会产生变化。\nMerkle树的应用场景在哪里呢? §\nMerkle树最实用的两个场景,其一是当比较两份大数据时,可以从根节点上就直接判断出两份数据是否相同(哪怕一个子数据不同,根节点的哈希值都不同)。\n其二是可以做 “Merkle证明”,即在整棵树尚未 完整下载 的情况下,仅通过下载的部分数据来进行完整性校验,快速判断某数据小组是否在其应处的位置,举例如图 4-6_ 所示。\n在这里我们有一组份数据包含了8个元素,依次是 [5,27,18,64,30,2,43,48] ,当我们在传输过程中收到了数据 “64” ,我们如何才能在其他数据尚未送达之前,证明以下两点?:\n\n数据 “64” 的确存在于这组组数据中。\n数据 “64” 存在的位置是第4格(第四顺位)。\n\n按照 Merkle证明 ,我们仅需知晓4个哈希值即可作出证明。  - 数字 “64” 的相邻数字 “18” 的哈希值 (图中为 1FXq)  - 相邻分组 “[5, 27]” 的联合哈希值 (图中为 ec20)  - 相邻分支的哈希值 (图中为 8f74)  - 根节点哈希值 (图中为 6c0a)\n证明推导过程如下:\n我们计算得出 “64” 的哈希值为 9Dog,将结果与哈希值 1FXq 串联,计算得出联合哈希值 781a。\n重复上述过程,将 781a 与 ec20 串联,计算得出联合哈希值 5c71。\n重复上述过程,将 5c71 与 8f74 串联,计算出根哈希值 6c0a。\n若根哈希值与我们从数据发送方传来的值 “6c0a” 对比,相等,则证明完毕。\n在整个校验过程中,我们并没有下载任何其他的数据,仅通过哈希值就能鉴别数据 “64” 的位置以及是否存在,是一种极其高效的方式,且可以横向扩展到任意大数量的数据集。\n\n原文：Merkle树和 Merkle证明 — 以太坊的指南针 1.0.0 documentation"},"NEAR":{"title":"NEAR","links":[],"tags":[],"content":"NEAR是一个Layer 1区块链，意味着它不依赖于其他链。它使用了一种独特的扩展机制（Nightshade分片），并且通过命名账户等方式使得新用户特别容易入门。它为Web3的大规模采用打开了大门。\nNEAR Protocol是一个去中心化应用平台，旨在促进未来的开放网络并推动其经济发展。NEAR Protocol于2020年推出，是一种基于PoS的第三代区块链，每秒处理1000笔交易，运行效率比PoW链高得多。NEAR未来的网络涵盖了从新货币到新应用甚至全新行业的一切。在NEAR平台上，开发人员可以托管无服务器应用程序和智能合约，并轻松访问开放金融网络的整个生态系统。\nNEAR的一些特点决定了整个协议的不可避免的成功：\n\n碳中和的区块链：NEAR的能源消耗相当于比特币的3分钟，网络已获得碳中和认证。NEAR Protocol通过应用PoS而不是PoW，使其的碳效率比比特币高出200,000倍。\n人类可读的账户，快速简单：在NEAR上，交易速度非常快（约1秒交易）。NEAR账户ID是人类可读的，而不是公钥哈希。用户可以注册命名账户（例如stakin.near），这样更容易使用和记住。此外，命名账户可以创建子账户，有助于更好地组织相关账户。\n独家拨款计划：NEAR通过拨款计划提供项目资金。利用这个独特的机会，已经有800多个项目获得资金支持，总计超过4500万美元。拨款委员会经过4轮内部批准。申请人通过评估阶段：初步筛选；技术审查；面试；委员会审查和决策。项目的选择是公开透明的。这种方法有助于NEAR协议发展社区，吸引年轻开发者，并为Web3的发展做出贡献。\n质押和收益：由于NEAR协议是一个去中心化和社区运营的生态系统，这意味着多个参与者合作以确保其安全性。这些参与者被称为验证者和委托人。验证者是确保区块生产和网络安全的主要参与者。委托人则通过质押代币并与验证者一起为网络的发展做出贡献。通过质押，双方都会获得奖励。验证者在每个时期结束时获得服务奖励。委托人也在每个时期结束时获得奖励，减去支付给验证者的费用。奖励在每个时期结束时复利计算，因此无需申领。此外，与许多其他代币不同，委托人可以质押任意数量的NEAR代币，因为没有最低质押金额。\n\nNEAR Protocol基于与比特币相同的基础技术，并结合了社区共识、数据库分片和可用性的进步。NEAR Protocol以构建全球最易于访问的网络为目标，为开发人员和终端用户提供服务，同时确保可扩展性和安全性。通过构建去中心NEAR是一个Layer 1区块链，意味着它不依赖于其他链。它使用了一种独特的扩展机制（Nightshade分片），并且通过命名账户等方式使得新用户的入门变得非常容易。这为Web3的大规模采用打开了大门。\n\nnear/nearcore: Reference client for NEAR Protocol"},"PLONK":{"title":"PLONK","links":[],"tags":[],"content":"PLONK的目的是让一个证明者（prover）向一个验证者（verifier）证明他知道一个值 X，这个值可以使一个给定的程序 P 的输出等于另一个值 Y。例如，证明者可能想要证明他知道一个密码，这个密码可以解开一个锁，而不用把密码告诉验证者。\n为了做到这一点，PLONK把这个问题转化为一个数学问题，即证明一组多项式方程的解。多项式是一种由变量和系数组成的代数表达式，例如 x2+3x−5。多项式方程是一种让多项式等于零的方程，例如 x2+3x−5=0。如果我们能找到一个数 x 使得方程成立，那么我们就说这个数是方程的解。例如，x=1 和 x=−5 都是上面方程的解。\nPLONK的核心思想是，如果我们能把程序 P 转化为一组多项式方程，那么我们就可以用多项式的性质来证明我们知道一个解 X。具体来说，PLONK使用了一种叫做多项式承诺（polynomial commitment）的技术，它可以让证明者把一个多项式的信息压缩成一个很小的值，叫做承诺（commitment），并且可以用这个承诺来证明他知道多项式在某个点的值，叫做开放（opening）。\nPLONK的流程大致如下：\n\n证明者和验证者事先协商好一个有限域 F 和一个子集 H。有限域是一种只有有限个元素的代数结构，例如 F=0,1,2,3,4,5,6。子集是有限域的一部分，例如 H=1,2,3。\n证明者和验证者共同参与一个可信安装（trusted setup）的过程，生成一个多项式 ZH​(x)，它的根是 H 中的所有元素，也就是说 ZH​(x)=0 当且仅当 x∈H。这个多项式叫做消失多项式（vanishing polynomial），因为它在 H 上消失了。可信安装的目的是让证明者和验证者都不知道 ZH​(x) 的系数，否则他们就可以伪造证明。\n证明者把程序 P 转化为一组多项式方程，例如 f1​(x)=0，f2​(x)=0，f3​(x)=0 等等。这些方程的解就是 X。证明者还要把 Y 也转化为一个多项式 y(x)。\n证明者把这些多项式方程合并成一个多项式 f(x)，它的形式是 f(x)=t(x)⋅ZH​(x)+y(x)，其中 t(x) 是一个商多项式（quotient polynomial）。这样做的好处是，如果 f(x) 在 H 上为零，那么就意味着所有的 fi​(x) 在 H 上为零，也就是说 X 是所有方程的解。\n证明者对 f(x) 和 t(x) 做多项式承诺，得到两个承诺 Cf​ 和 Ct​，并把它们发送给验证者。\n验证者随机选择一个点 z∈F，并把它发送给证明者。\n证明者计算 f(z) 和 t(z)，并用承诺 Cf​ 和 Ct​ 来证明它们是正确的。证明者还要计算 ZH​(z) 和 y(z)，并把这些值发送给验证者。\n验证者检查 f(z)=t(z)⋅ZH​(z)+y(z) 是否成立，以及证明者的开放是否有效。如果都成立，那么验证者就接受证明，否则就拒绝证明。\n\n这就是PLONK的基本流程，当然还有很多细节和优化，例如如何处理排列（permutation）和线性组合（linear combination），如何选择有限域和子集，如何实现多项式承诺和开放等等。\n\nUnderstanding PLONK --- 了解 PLONK"},"Plasma":{"title":"Plasma","links":["Layer2","Merkle-树"],"tags":[],"content":"Plasma 是另一个 Layer2 扩容解决方案。Plasma 利用智能合约和 Merkle 树 创建无限数量的子链，这些子链都是主链（主要是以太坊链）的拷贝。将交易从主链 (Layer1) 转移到子链 (Layer2) 可以实现快速低成本的交易。和侧链一样，每个子链都被视为独立的区块链，有自己的共识机制、节点、块大小和块时间。\n和通道一样，Plasma 利用主链的安全性。主链和子链通过“智能合约”联系在一起，这些合约包含指导每个子链运行的规则。合约扮演着主链和子链之间 asset/币之间转移的桥梁角色。起初，所有交易都必须首先在主链上创建。\n如果在 Plasma 子链中检测到任何欺诈或可疑行为，Plasma 用户可以退出 Plasma 链，回到主链。\nPlasma 如何运行？ §\n\n\n子链运营商会在子链上定义其运行规则。\n\n\n交易继续在 Plasma 链上进行。但 Plasma 链每个块的块头（包含 Merkle 根）会提交并记录在主链块中。这可以减轻主链网络拥堵，使成千上万笔交易同时在 Plasma 链上处理。\n\n\n通过“欺诈证明”验证子链数据。欺诈证明机制可以让任何人使用 Merkle 证明判断数据是否无效。例如，如果在 Plasma 链上出现双花或提取超过账户余额等欺诈行为，任何人都可以提供欺诈证明来证明该交易无效。如果交易被证明有欺诈，则回滚该交易。\n\n\n最容易理解的 Plasma 版本是 Plasma Cash。Plasma Cash 的工作原理是将每个单独的硬币视为一个单独的 NFT，并跟踪每个硬币的单独历史记录。Plasma 链有一个操作员，负责制作和定期发布区块。每个区块中的交易都存储为稀疏的默克尔树：如果交易转移了硬币的所有权 k ，它就会出现在树 k 的位置。当 Plasma 链运营商创建一个新区块时，他们会将 Merkle 树的根发布到链上，并直接向每个用户发送与该用户拥有的硬币相对应的 Merkle 分支。\n任何等离子系统的主要风险是操作人员行为不端。这可能以两种方式发生：\n\n发布无效区块（例如，操作员包括将硬币 1 从弗雷德发送到赫敏的交易，即使弗雷德当时并不拥有该硬币）\n发布一个不可用的区块（例如，运营商没有向 Bob 发送其中一个区块的 Merkle 分支，从而阻止他向其他人证明他的硬币仍然有效且未使用）\n\n如果运营商以与用户资产相关的不当行为行事，则用户有责任立即退出（具体而言，在 7 天内）。当用户（“退出者”）退出时，他们会提供一个默克尔分支，证明包含将该代币从前所有者转移给他们的交易。这将开始为期 7 天的挑战期，在此期间，其他人可以通过提供以下三件事之一的 Merkle 证明来挑战该退出：\n\n非最新所有者：由退出者签署的稍后交易，将退出者的硬币转让给其他人\n双花：将硬币从前所有者转移到其他人的交易，在将硬币转移给退出者的交易之前包括在内\n无效历史记录：在之前（过去 7 天内）转移硬币且没有相应支出的交易。退出者可以通过提供相应的支出来响应;否则，退出将失败。\n\n根据这些规则，任何拥有硬币的人都 k 需要查看过去一周所有历史树中所有默克尔位置 k 的分支，以确保他们确实拥有硬币 k 并可以退出它。他们需要存储所有包含资产转移的分支，以便他们能够应对挑战并安全地带着他们的硬币退出。\n优点 §\n\n\nPlasma 链比通道更适用，因为在 Plasma 链上可以把资产/币发送给任何人，而通道交易只能在两个参与方之间进行。\n\n\nPlasma 链的优点在于利用主链的安全性。如果侧链遭到攻击，主链不受影响，但主链无法保护侧链用户。而 Plasma 链利用主链安全，在发生攻击时，Plasma 用户可以退出回到主链。因此 Plasma 的安全性大于侧链。\n\n\n限制 §\n\n\nPlasma 的一个劣点是用户从 Layer2 提取币到 Layer1 需要相对较长的等待时间。\n\n\n用户必须等待至少 7-14 天才能完成提取，这段时间用于验证提取交易是否有欺诈。\n\n\n例子 §\n利用 Plasma 在以太坊上的一个项目是 OMG。\nPlasma 和侧链的区别是什么？ §\n\nPlasma 是一种设计上比侧链更安全的解决方案。\nPlasma 通过将 Plasma 区块的根信息发布到主链（例如以太坊）上，实现了更高的安全性。用户可以使用区块根来证明他们在 Plasma 链上收到了资金。如果 Plasma 链的共识机制停止创建区块，用户可以使用区块根向主链提出索赔。\n与侧链相比，Plasma 不能进行与侧链相同的复杂操作。Plasma 的设计不依赖于信任假设来保证资金安全，因此需要围绕 Plasma 的共识机制进行设计。这对于 Plasma 链上可能发生的事情增加了额外的限制。\n\nV 神对 Plasma 的看法 §\nPlasma是一类区块链扩容解决方案，允许所有数据和计算，除了存款、取款和Merkle根外，都保持在链下。这为非常大的可扩展性收益打开了大门，而这些收益不会受到链上数据可用性的瓶颈。Plasma 于 2017 年首次发明，并在 2018 年进行了多次迭代，最著名的是 Minimal Viable Plasma、Plasma Cash、Plasma Cashflow 和 Plasma Prime。不幸的是，Plasma 在很大程度上被 rollup 所取代，原因主要与 （i） 巨大的客户端数据存储成本有关，以及 （ii） Plasma 的基本局限性，这使得它很难在支付之外进行推广。\n有效性证明（又名 ZK-SNARKs）的出现让我们有理由重新考虑这一决定。让 Plasma 用于支付的最大挑战，即客户端数据存储，可以通过有效性证明有效地解决。此外，有效性证明提供了广泛的工具，使我们能够制作一个运行 EVM 的类似 Plasma 的链。Plasma的安全保证不会覆盖所有用户，因为不可能将Plasma风格的退出游戏扩展到许多复杂的应用程序背后的根本原因仍然存在。然而，在实践中，很大一部分资产仍然可以保持安全。\n\nExit games for EVM validiums: the return of Plasma --- EVM 验证的退出游戏：Plasma 的回归"},"Polygon":{"title":"Polygon","links":[],"tags":[],"content":"Polygon（原名 Matic Network）是一个旨在创建与以太坊兼容的多链区块链系统的区块链平台。它使用与以太坊相同的权益证明共识机制来处理链上交易。Polygon 的原生代币名为 MATIC，它是一种 ERC-20 代币，与其他以太坊加密货币兼容。Polygon 在去中心化应用（dApps）中得到应用，如 DeFi、DAO 和 NFTs。\n历史：\n\nMatic Network 于 2017 年由四位孟买软件工程师创立）。\n2021 年 2 月，该项目更名为 Polygon Technology。\n2021 年 12 月，Polygon 以 2.5 亿 MATIC 代币（约合 4 亿美元）的价格收购了 Mir 区块链网络。ZK-rollups 旨在将数据从以太坊转移到 Polygon，以降低费用、加快交易速度并保持安全性）。\n2021 年 12 月，Polygon 披露了一个安全漏洞，导致 801,601 个 MATIC 代币被盗）。\n2022 年 2 月，Polygon 通过出售 MATIC 代币筹集了 4.5 亿美元的资金，由 Sequoia Capital India 领投，包括 Tiger Global 和 Softbank Vision Fund。\n2022 年 12 月 15 日，唐纳德·特朗普在 Polygon 网络上推出了一系列数字艺术 NFT，每个售价 99 美元）。\n\n技术：\n\nPolygon 使用一种修改过的权益证明共识机制，可以在每个区块中实现共识。传统的权益证明需要处理多个区块才能达成共识。参与 Polygon 网络的验证者需要抵押（同意不交易或出售）他们的 MATIC 代币，以换取验证 Polygon 网络交易的权利。成功的验证者将获得 MATIC 代币作为奖励。Polygon 网络旨在解决以太坊平台的问题，包括高交易费用和处理速度慢）。\n\n合作伙伴关系：\n\n2022 年 7 月，Polygon 参与了迪士尼的 2022 年加速计划，以扩展增强现实、NFT 和人工智能领域。\n2022 年 10 月，印度 Firozabad 警察开始使用 Polygon 报告犯罪。\n\n\nLearn more:\n\nPolygon (blockchain) - Wikipedia\nWeb3 Adoption by Major Brands Shifts to Polygon in 2023\nPolygon and Major Brands: Catalysts for Web3’s Mass Adoption?\n"},"Rollup":{"title":"Rollup","links":["Layer2","ZK","zkSync"],"tags":[],"content":"简要介绍 §\nRollup 是一种区块链层级解决方案，可以将交易的执行从主链 (Layer1) 转移到辅助链 (Layer2) 来提供扩容。在 Rollup 中，主链上只记录执行过的交易批次的证明，而不记录每笔交易的细节。这可以大大减轻主链的工作量。\n工作原理 §\nRollup 工作原理可以概括为以下几步：\n\n\n在主链上部署一个 Rollup 合约，存储辅助链当前状态哈希值 (state root)。\n\n\n当在辅助链上执行交易时，状态哈希值 (state root) 会改变。此时需要将更新后的状态哈希值上链。\n\n\n执行过的交易会被打包压缩成一个批次，并附带更新前后状态哈希值上链。\n\n\nRollup 合约验证批次内前后状态哈希值是否匹配，如果匹配则将状态哈希值更新。\n\n\n类型 §\nRollup 主要有两种类型：\n零知识证明 Rollup(ZK Rollup) §\n每批交易执行都需要提交 零知识证明 (SNARK), 证明新的状态哈希值就是正确执行该批交易后的结果。任何人都可以使用零知识证明验证批次内交易的有效性，而不会泄露交易内容。\n例子：\n\nzkSync\n\n乐观 Rollup(Optimistic Rollup) §\n批交易上链时不实质验证，采取”无罪推定”方式。如果出现欺诈证明，将回滚不合法的交易批次。验证时间一般需要 7 天。\n优势 §\n\n比 Plasma 提供更高安全性，由于携带更多关键数据上链\n可在辅助链运行 EVM, 兼容 Ethereum 现有应用\n提供更廉价的 Gas 费用\n\n限制 §\n\n扩容程度受主链交易记录数量限制\n辅助链仍需支付 Gas 费用执行交易\n欢快 Rollup 需要更长的提取时间\n\n所以总之，Rollup 使用辅助链来带来扩容，同时利用主链提供安全保证。它解决了 Plasma 长期安全性问题，提高了通用性，但扩容空间和提取速度依然有待改进。"},"Solana":{"title":"Solana","links":["智能合约"],"tags":[],"content":"Solana是一个于2017年推出的区块链平台，它承诺解决当时主要区块链面临的可扩展性问题。\nSolana支持智能合约程序，程序是在特定条件下自动执行的代码片段。这些程序可以使借贷、借款和创建协议等操作变得非常简单。例如，你可以编写一个程序，在巴基斯坦击败印度的板球比赛中，将钱从A转给B，或者编写一个程序，在不使用任何银行的情况下，借出钱并获得利息。在主要金融机构中，仍然需要中间人来验证交易是否正确处理。然而，通过使用程序，不再需要中间人，整个过程可以自动化。虽然还有其他支持程序的区块链，最著名的例子是以太坊，但Solana在许多方面都比以太坊更具优势，有望实现大规模采用。\nSolana的一些优势包括：\n\nSolana的交易速度比以太坊快得多。\nSolana比以太坊更便宜，以太坊上的交易可能需要数百美元。\nSolana更容易编程（Solidity仅适用于以太坊，RUST在区块链之外也有用途）。\nSolana是新兴的并且正在快速扩张。\n\n\nsolana-labs/solana: Web-Scale Blockchain for fast, secure, scalable, decentralized apps and marketplaces."},"Squads":{"title":"Squads","links":["多签钱包"],"tags":[],"content":"Squads是Solana生态系统中的一个项目，它是一个领先的Solana多签钱包解决方案。它简化了开发者和财务资产的管理，可以安全地将财务、程序、验证器和代币存储在多签钱包中，并与团队一起管理。Squads是Solana上最大的团队和协议使用的多签解决方案。\nSquads V3是Squads的最新版本，它是一个可靠的多签钱包标准，旨在为Solana生态系统提供可靠且用户友好的多签体验。以下是Squads V3的一些关键特点和优势：\n\n\n安全性：Squads V3采用了安全优先的设计理念，通过多个独立的审计、开源代码、同行评审和安全工具来确保安全性。\n\n\n产品功能：Squads V3提供了基本的多签功能，包括发送/接收资产、程序管理和交易构建器等。它还与其他Solana生态系统中的项目进行了集成，如Dialect通知、Bonfida的Solana命名服务、Magic Eden和Cardinal身份等。\n\n\n路线图：Squads团队计划在未来几周和几个月内进一步完善Squads V3的功能，包括财务管理、代币管理、DAO和Squads的集成等。\n\n\nSelf Custody Society (SCS)：Squads团队成立了一个名为Self Custody Society (SCS)的团队集体，旨在与其他团队合作，共同推动自托管和多签在Solana生态系统中的应用。SCS成员将提供反馈和支持，并享有早期访问新功能、集成优先权和会员NFT等特权。\n\n"},"TON":{"title":"TON","links":[],"tags":[],"content":"TON（The Open Network）是一个由Telegram创建的区块链平台，它是Web3领域的一个重要项目。最初名为Telegram Open Network（TON），该项目旨在为Telegram的用户提供快速、安全的去中心化支付、数字身份和其他服务。\n以下是关于TON的一些重要信息：\n\n\nTON的历史：在2018年，Telegram发布了名为Gram的白皮书和精简版白皮书，并成功通过代币私人销售筹集了17亿美元的资金。然而，由于监管和法律问题，该项目在一段时间内停滞不前。后来，一个由开源开发者组成的小团队接手了TON的开发，并将其更新为The Open Network（TON）。\n\n\nTON的目标：TON的目标是建立一个高性能的区块链平台，支持每秒数百万笔交易，并提供去中心化的生态系统。它旨在为用户提供快速、安全的支付和其他服务，并支持去中心化应用程序（dApps）的开发和使用。\n\n\nTON的核心技术：为了实现高性能，TON采用了多链架构和无限分片的设计。它具有一条主链和多条工作链，每条工作链又可以细分成多个分片链。此外，TON采用了POS（权益证明）共识算法，并使用超立方体即时路由来降低分片链之间的消息路由延迟。\n\n\nTON的应用场景：TON的应用场景非常广泛，包括支付、数字身份、去中心化金融（DeFi）、去中心化交易所（DEX）等。它为开发者提供了丰富的工具和资源，使他们能够构建各种基于区块链的应用程序和服务。\n\n\nTON的发展和社区支持：尽管TON在发展过程中遇到了一些挑战，但它获得了区块链和加密货币社区的极大关注和支持。开发者们在全球范围内积极参与TON的开发，并为其功能性的改进做出了贡献。\n\n\n总结起来，TON是一个由Telegram创建的区块链平台，旨在为用户提供快速、安全的去中心化支付、数字身份和其他服务。它采用了多链架构和无限分片的设计，具有高性能和广泛的应用场景。\n\nLearn more:\n\nTON是什么？怎么买最赚钱？ - FX168财经\nWeb3商业模式拆解系列|The Open Network(TON)简介 | by Eric Kwok | Oct, 2023 | Medium\n专访TON Foundation 增长总监：Web3领域的微信：TON_加密_bot_用户\n"},"Web3":{"title":"Web3","links":["加密货币"],"tags":[],"content":"Web 3.0 是指下一代互联网的发展阶段，旨在改变互联网的架构和用户体验。与现有的Web2.0相比，Web3更加去中心化、开放和用户主导。\nWeb3的核心概念是区块链技术和去中心化应用（DApps）。区块链技术提供了安全、透明和不可篡改的数据记录方式，使得去中心化应用能够在没有中心化机构的情况下实现可信的交互和价值传递。\nWeb3的目标是让用户对自己的数据和数字资产拥有更多的控制权，不再依赖于中心化的互联网巨头。它通过智能合约和加密货币等技术，使用户能够直接参与到网络中，并获得更好的隐私保护、数据所有权和经济激励。\nWeb3的特点包括：\n\n去中心化：排除了传统互联网中的中心化机构和单点故障，使系统更加健壮和可靠。\n自主身份：用户可以拥有自己的身份标识，并控制自己的个人数据。\n去信任交互：通过智能合约和加密算法，实现了双方之间的可信交互，减少了对第三方的依赖。\n去中介化：通过智能合约和去中心化应用，实现了直接的点对点交互，减少了中间环节和中介机构。\n\nWeb3的发展涉及到区块链技术、密码学、去中心化存储、分布式系统等多个领域，目前仍处于快速发展和探索阶段。Web3的应用领域包括数字货币、去中心化金融（DeFi）、数字身份验证、供应链管理和社交网络等。"},"ZK":{"title":"ZK","links":[],"tags":[],"content":"ZK §\n零知识证明（Zero-Knowledge Proof，简称ZK）是一种密码学概念，用于证明某个主体拥有某个信息，而不需要将实际信息透露给验证者。它允许一个主体在不泄露私密数据的情况下，向另一个主体证明某个陈述是正确的。\n原理 §\n原理是通过在证明者和验证者之间进行交互，证明者可以向验证者证明某个陈述的正确性，而不需要透露陈述的具体内容。在这个过程中，证明者通过展示对陈述的知识，使验证者相信陈述是正确的，但并不泄露陈述的实际信息。\n特点 §\n\n隐私保护：零知识证明允许证明者在不泄露私密数据的情况下向验证者证明某个陈述的正确性。\n高效性：零知识证明可以在较短的时间内完成验证，即使对于复杂的陈述内容，验证长度也相对较短。\n非交互式：在最初的零知识协议中，证明者和验证者需要多次来回通信。但在非交互式结构中，证明者只需发送一条证明给验证者，从而实现了一次性的交互。\n\n目前主要的实现方式 §\n\nZK-SNARKS\nZK-STARKS\nBulletproofs\nPlonk\n\nzk-SNARKs §\nzero知识证明(zk-SNARKs)是什么?\nzk-SNARK是Zero-Knowledge Succinct Non-Interactive Argument of Knowledge的缩写,它指一种证明构造,其中一个人可以证明某些信息的有效性,例如秘密密钥,而不展示该信息内容,也不需要证明者和验证者之间的交互。\nZcash是首个广泛应用zk-SNARK技术的项目,它利用一种新的零知识加密技术。Zcash中的受保护交易可以完全加密在区块链上,但是使用zk-SNARK证明还是可以验证其有效性,符合网络共识规则,从而获得强大的隐私保护能力。\n“零知识”证明允许一方(证明者)向另一方(验证者)证明某个语句的正确性,而不会泄露该语句有效性之外的任何信息。例如,给定一个随机数的哈希值,证明者可以确保该数字存在,而不展示其具体值。\n在“知识证明”中,证明者可以证明不仅该数字存在,而且他实际拥有这个数值- 同样不展示任何数值信息。\n“简洁”的零知识证明可以在几毫秒内验证,证明长度只有几百字节,即使针对非常大的程序陈述。之前的零知识协议需要多轮交互,而“非交互”构造仅需要一个从证明者到验证者的消息。Halo前,产生非交互且短小能上链的零知识证明最高效方法是初始化阶段生成一个公共参考字符串。如果有人获取生成这个公共参数的秘密随机性,就能伪造出看起来有效的错误证明。\n\n\nzkSNARKs与zcash | Zhuang’s Diary\n详解零知识证明：未来 10 年 Web3 和区块链最重要的解决方案之一 | CoinVoice\n[译]对于 zk-SNARKs 运行的简介 - DavidCai\n"},"index":{"title":"欢迎","links":["Web3"],"tags":[],"content":"欢迎访问 Cryptedia，一个 Web3 百科全书。"},"zkSync":{"title":"zkSync","links":["Rollup","链下证明"],"tags":[],"content":"zkSync 是一种 Layer 2 解决方案中的一种 rollup 技术，具体来说，zkSync 是一种 ZK rollup。每个交易批次都会发送到一个离线的证明者，该证明者会生成一个密码学证明（在 zkSync 的情况下称为 SNARK），证明这些交易是有效的。生成证明的过程很困难，但验证证明的有效性很容易。这种便利性意味着可以将证明发送到 Layer 1 并在智能合约中进行验证，从而实现 Layer 1 和 Layer 2 之间几乎无摩擦的转账。\n与其他支持 EVM 兼容性的 ZK rollup（zkEVMs）不同，zkSync 支持账户抽象。账户抽象将每个账户转化为具有自己逻辑的智能合约，这是一个重大突破，使每个人都可以拥有适合自己需求的账户，使加密货币安全、易用，并与其他系统无缝兼容。\nzkSync 是由 Matter Labs 开发的，他们获得了以太坊基金会和顶级投资者（如 Union Square Ventures）的资金支持。zkSync 自 2020 年 9 月以来一直处于运行状态。"},"zkWASM":{"title":"zkWASM","links":["零知识证明"],"tags":[],"content":"zkWASM（Zero-Knowledge WebAssembly）是一种零知识证明的计算证明生成器，它允许在不重新运行计算的情况下验证计算结果。zkWASM提供了一个环境，开发人员可以在其中信任计算结果，而无需了解或查看计算本身。这种技术结合了传统编程灵活性和注重隐私的零知识证明，为去中心化技术开启了新的用例，同时确保了强大的安全性、隐私性和互操作性，有潜力颠覆区块链行业。\n重要性 §\n\nzkWASM可以吸引更广泛的开发者社区，让传统开发者能够为区块链构建应用程序，从而推动区块链技术的大规模采用。\nzkWASM使用零知识证明，通过离链计算和链上验证的组合，显著加快了交易时间，使区块链更加高效。\n使用零知识证明确保所有交易的安全性和隐私性，增强了区块链的整体安全性。\n\n工作原理 §\n\nzkWASM是一个可移植的虚拟机，允许开发人员使用自己喜欢的编程语言编写保护隐私的应用程序，并将其编译为WebAssembly，而无需具备零知识证明技术的专门知识。\n用户可以像普通应用程序一样在浏览器中使用这些应用程序，而无需任何特殊的硬件或软件来运行这些应用程序。\n\n用例 §\n\nzkWASM可以为基于ZKP的隐私保护应用程序开辟各种用例，包括零知识游戏、社交应用、办公应用、供应链身份管理等。\n\n总结：\nzkWASM是一项将传统编程灵活性与注重隐私的零知识证明相结合的有趣技术。它为去中心化技术开启了新的用例，同时确保了强大的安全性、隐私性和互操作性，有潜力颠覆区块链行业。"},"三明治攻击":{"title":"三明治攻击","links":["先行交易攻击"],"tags":[],"content":"三明治攻击是DeFi中的一种先行交易攻击,攻击者会在其他用户待运行的交易前后放两个交易,以操纵某资产的价格从而获利。例如,如果攻击者看到有用户想用LINK买入大量ETH,攻击者首先可以用更高 Gas费买入ETH,然后让用户以更高价格买入ETH,最后以更高价格卖出ETH。通过这种方式,攻击者可以造成人为的价格上涨,从中获得利润,而用户得到的ETH会比预期少。\n三明治攻击之所以可能,是因为区块链交易的透明度和延迟性。攻击者可以在内存池中查看待运行交易,利用更高Gas费获取确认顺序的优先级。三明治攻击主要针对使用自动市场做市商(AMM)提供流动性和价格发现的分散式交易所(DEX)。曾受三明治攻击影响的一些DEX有Uniswap、SushiSwap和PancakeSwap。\n为防止或缓解三明治攻击,用户可以采取一些预防措施,如:\n\n\n设置更低的滑点容限,即预期交易与实际交易价格间的最大偏差。这可以降低以不利价格买卖的风险,但也可能增加交易失败的几率。\n\n\n使用限价单,即指定交易价格和数量的订单。这样可以防止攻击者操纵价格,但也可能需要更长时间成交或需要第三方服务。\n\n\n使用Flashbots网络,即直接从用户那里接受非公开广播到内存池的交易的矿池网络。这样可以防止攻击者查看待运行交易进行前运行,但也可能需要更高Gas费或技术能力。\n\n"},"以太坊":{"title":"以太坊","links":["加密货币","塔利克·布特林","Gas","Layer2","通道"],"tags":[],"content":"以太坊（Ethereum）是一个公共区块链平台。它通过以太币（Ether，简称ETH）作为加密货币，提供了一个去中心化的虚拟机（EVM，以太虚拟机，Ethereum Virtual Machine）来执行智能合约。以太坊的概念最早由程序员维塔利克·布特林在2013年至2014年间提出，受到比特币的启发。\n特点和功能：\n\n智能合约：以太坊上的智能合约是存储在区块链上的程序，由各个节点执行，并需要执行者支付手续费给矿工或权益人。\n分布式应用程序（DApps）：以太坊支持分布式应用程序的开发，这些应用程序在以太坊上运行，不会停机或被关闭。\n代币发行：以太坊的智能合约可以创建代币，供分布式应用程序使用。代币化使得用户、投资者和管理者的利益保持一致，并且可以用于进行首次代币发行。\n权益证明（Proof of Stake）：以太坊正在逐步过渡到权益证明机制，以取代传统的工作量证明机制。这将提高效率，节省能源，并减少中心化的风险。\n燃料费用（Gas）：以太坊引入了燃料的概念，用于支付执行各种操作的费用，包括发送以太币或其他代币。\n第二层解决方案（Layer2）：为了减轻主链的负担并提高交易速度，以太坊还开发了各种第二层解决方案，如通道、支链和Rollup。\n\n以太坊的发展历史包括多次升级，每次升级都引入了新的功能和改进。一些重要的升级包括伊斯坦布尔、柏林和伦敦。\n以太坊的出现使得开发者能够构建更加灵活和功能丰富的区块链应用程序，从而推动了区块链技术的发展和创新。"},"侧链":{"title":"侧链","links":["Merkle树"],"tags":[],"content":"侧链是与主链通过两次密码学校验 (2WP) 链接的独立区块链，这有助于处理主链一些数据。\n侧链通过 2WP 与主链连接，每个链都有自己的规则、功能和目的。\n与其他第二层解决方案如通道、等离子体和缩放不同，它们利用第一层的安全性，侧链本身负责自己的安全性。\n侧链的另一个重要点是它需要自己的节点来验证交易和创建块。\n\n它们也有自己的一致性机制（如 POW、POS、权威证明、DPoS 等）和块参数。\n验证交易并创建块的节点通过同样的方式在侧链中获得报酬，就像其他所有区块链一样工作。\n\n尽管侧链彼此独立，但它们共同形成一个整体生态系统。\n工作原理 §\n侧链的工作原理是：\n\n\n处理和验证主链的数据\n\n\n或添加功能，如让无法运行智能合约的比特币链运行智能合约\n\n\n侧链通过 2WP 与主链进行通信；因此，侧链也称为挂钩侧链。\n\n\n2WP：2WP 充当中间人，用以从主链（第一层）向侧链（第二层）转移资产或币，反之亦然。\n\n实质上，币并未转移；相反，通过在主链创建一次交易来临时锁定币。然后生成另一笔交易在侧链解锁相同数量的等值币。\n主链上的币只有当等量的侧链币再次被锁定时才能解锁。这是为避免同时在两条链上拥有免费币而产生双重花费问题。\n2WP 系统使得相关方可以在不向整个网络公开信息的情况下进行侧链交易。\n\n\n\n第三方存在：第三方/权威机构负责主链和侧链之间的锁定和释放功能。初始化一笔用于锁定币的交易。经过节点达成一致后，签名块提交至主链。这自动在主链上锁定币。\n控制双向挂钩的可信权威然后在侧链中发行等值币给交易方。交易方则可以在侧链范围内进行一系列交易。一旦交易完成，权威机构再验证交易，通过在主链上解锁对应币来释放币。\n整个侧链结构是基于双向挂钩和维护两条链之间交易完整性的可信权威。权威机构的存在可能通过给予它过于强大的权力而带来中心化。\n\n\nSPV 证明：SPV（简单付款验证）证明是一种密码学证明，证明币已在主链上锁定用于侧链使用。与检查所有前置交易（速度较慢）不同，SPV 也证明在主链上发起的该交易是否合法并属于有效块的一部分。通过 SPV，侧链节点无需每次验证时全下主区块链。比特币和以太坊支持 Merkle证明形式的 SPV。Merkle 证明包括 Merkle 根和 Merkle 路径。\n每个对号入座的交易对使用哈希函数求和，继续下去直到一个哈希值为整个块的哈希，称为 Merkle 根或根哈希。Merkle 路径就是重新生成根哈希所需的哈希值集合。例如，交易 D 的 Merkle 路径为 C 交易的哈希、AB 交易对的哈希、EFGH 交易对的哈希以及 Merkle 根。\n侧链节点重复哈希操作计算根哈希值。如果得到的根哈希值与 SPV 中的根哈希值匹配，即表示主链已发起锁定币的该交易。\n\n\n例子 §\n比特币侧链的例子有 Liquid 网络和 RSK。Liquid 网络每分钟添加一个块，相比比特币每 10 分钟添加一个块。通过添加 RSK 侧链，比特币可以使用智能合约，从而拓宽其功能。因此，RSK 可以为比特币协议添加以太坊样式的层，使比特币协议能够使用智能合约开发 DApp。\nxDai 链、POA 网络和 Polygon（前身为 Matic 网络）都是以太坊侧链的例子。通过使用相同的以太坊虚拟机，使侧链与以太坊主链之间实现互操作性。所以部署到以太坊基础层的合约可以直接部署到侧链。\n优点 §\n\n\n侧链通过将大量交易转入其侧链进行处理，提高了交易吞吐量，同时处理交易速度更快。它们还显著降低了交易费用。例如，以太坊侧链 Polygon 声称每个秒可实现 65000 笔交易，交易费用约 1 美元。\n\n\n公共区块链具有透明性和可审计性。每个交易都记录并可由任何参与者验证。但对企业来说，公共区块链由于可能披露大量商业细节信息的风险而不那么有用。但通过侧链，交易的隐私性可以得到保障。与主链作为验证散列数据的存储库不同，侧链专门设计为符合企业需求的私有和被许可 Blockchain，侧链可以安全地存储企业特定数据，从而更安全可靠，免受黑客攻击。\n\n\n挑战：大多数侧链比主链更加集中，由此为速度提供了一定程度的安全 trade-off。因此，可以选择将最敏感细节保留在主链上，以保持安全性，而将信息外包到侧链。"},"先行交易攻击":{"title":"先行交易攻击","links":["去中心化金融"],"tags":[],"content":"先行交易攻击(Front-running Attacks)是一种利用区块链交易的延迟和透明性来获取不正当利益的攻击方式。简单地说，就是在知道别人的交易意图之后，先于他们执行自己的交易，从而影响市场价格或者抢占优势资源。这种攻击在传统金融市场中是非法的，但在去中心化金融（DeFi）中却很常见，因为区块链的交易是公开的，而且有一定的确认时间。抢先交易攻击主要有以下几种形式：\n\n\nDisplacement：这种攻击是指攻击者使用更高的燃料费（gas fee）来确保自己的交易优先于其他交易被打包和确认。例如，如果攻击者发现有人要购买某个代币，他们就可以用更高的燃料费来抢先购买，从而推高代币的价格，然后再卖出获利。\n\n\nInsertion：这种攻击是指攻击者利用自己的矿工身份或者收买矿工，来插入自己的交易到某个区块中，从而影响其他交易的结果。例如，如果攻击者发现有人要从一个去中心化交易所（DEX）中兑换某个代币，他们就可以在同一个区块中插入自己的兑换交易，从而改变池子中的兑换比率，让其他人得到更少的代币。\n\n\nSuppression：这种攻击是指攻击者利用自己的矿工身份或者收买矿工，来拒绝或者延迟打包某些交易，从而阻止或者延误其他人的操作。例如，如果攻击者发现有人要从一个智能合约中提取资金，他们就可以拒绝打包这个交易，从而让其他人无法及时退出，或者趁机提高自己的燃料费来抢先提取。\n\n\n抢先交易攻击对DeFi的安全和公平性构成了严重的威胁，造成了大量的经济损失。根据一项研究，仅在2022年，抢先交易攻击就导致了超过10亿美元的最大可提取价值（MEV）。为了防止或者减少抢先交易攻击，有一些可能的解决方案，如：\n\n\n使用零知识证明（ZKP）或者同态加密（HE）等技术，来隐藏交易的细节，从而防止攻击者获取交易的意图。\n\n\n使用承诺机制（commit-reveal scheme），让用户先提交一个加密的交易，然后在一定时间后再揭示交易的内容，从而增加攻击者的成本和风险。\n\n\n使用链下预言机（off-chain oracle）或者第二层协议（second-layer protocol），来减少交易的延迟和燃料费，从而降低攻击者的机会和收益。\n\n"},"共识攻击":{"title":"共识攻击","links":["工作量证明"],"tags":[],"content":"共识攻击是一种针对区块链系统的攻击，目的是破坏区块链的一致性和安全性，从而获得不正当的利益或者破坏区块链的运行。共识攻击的方式有多种，主要取决于区块链采用的共识机制和网络环境。一些常见的共识攻击有：\n\n51%攻击：这种攻击是针对采用工作量证明（Proof of Work，PoW）机制的区块链，例如比特币和以太坊。攻击者如果控制了超过全网一半的算力，就可以在私有链上产生更长的有效链，从而覆盖公共链上的交易记录，实施双花攻击或者拒绝服务攻击 。\n长程攻击：这种攻击是针对采用权益证明（Proof of Stake，PoS）机制的区块链，例如Cardano和Tezos。攻击者如果能够获取一段时间以前的投票权，就可以在私有链上重新构建历史区块，从而使私有链的权重超过公共链，实施历史修正攻击或者分叉攻击 。\n女巫攻击：这种攻击是针对基于P2P网络的区块链，例如IPFS和Filecoin。攻击者如果能够创建大量的虚假节点或者控制大量的真实节点，就可以在网络中形成多数派，从而影响网络的拓扑结构和信息传播，实施拒绝服务攻击或者共识操纵攻击 。\n\n共识攻击的防御措施有以下几种：\n\n调整难度系数：区块链可以根据网络的算力或者投票权的分布，动态地调整区块的生成难度，从而增加攻击者的成本和风险 。\n引入惩罚机制：区块链可以通过设计一些激励和惩罚的规则，来鼓励诚实的节点参与共识，同时惩罚作恶的节点，从而维护网络的安全和稳定 。\n增加节点的多样性：区块链可以通过引入不同类型的节点，例如轻节点和全节点，来增加网络的多样性和鲁棒性，从而降低攻击者的影响力和成功率 。\n"},"加密货币":{"title":"加密货币","links":["以太坊"],"tags":[],"content":"加密货币是一种数字资产，它使用密码学技术来保护交易的安全性，并控制新货币的发行。加密货币使用分布式账本技术（如区块链）来记录和验证交易，并且不依赖于中央机构（如银行或政府）进行管理。\n加密货币最著名的代表是比特币（Bitcoin），它是第一个成功实现去中心化数字货币的项目。\n除了比特币，还有许多其他的加密货币，如以太坊（Ethereum）、莱特币（Litecoin）和瑞波币（Ripple）。每种加密货币都有其独特的特点和用途，有些被设计用于快速、低成本的交易，有些则专注于智能合约和去中心化应用的开发。"},"区块链":{"title":"区块链","links":[],"tags":[],"content":"区块链是一种分布式账本技术，它以去中心化的方式记录和验证交易数据。简单来说，它是一个由多个计算机节点组成的网络，这些节点通过共识算法达成一致，并将交易数据按照时间顺序链接成一个个区块，形成一个不可篡改的链式结构。\n区块链的核心特点是去中心化和安全性。传统的中心化系统中，数据由中心机构控制和管理，而区块链通过分布式的方式，将数据存储在网络的每个节点上，没有单一的控制机构。这意味着没有中心化的弱点，数据更加安全可靠。\n区块链的工作原理可以简单概括为以下几个步骤：\n\n交易发生：参与者通过区块链网络进行交易，例如转账、购买商品等。\n交易验证：网络中的节点将交易验证，并确保交易的有效性和合法性。\n区块生成：经过验证的交易被打包成一个区块，并与之前的区块链接在一起，形成一个新的区块。\n共识达成：网络中的节点通过共识算法（如工作量证明、权益证明等）达成一致，确认新区块的有效性，并将其添加到区块链上。\n区块链更新：新的区块被添加到区块链的末尾，成为最新的区块，包含了最新的交易数据。\n\n一旦区块被添加到区块链上，它就不可更改。因为每个区块都包含了前一个区块的哈希值，任何对区块的篡改都会导致后续区块的哈希值不匹配，从而被网络中的节点拒绝。\n区块链技术不仅仅用于加密货币（如比特币），还可以应用于各种领域，如供应链管理、智能合约、数字身份验证等。它的去中心化和安全性特点使得数据交换更加透明、可信，并且减少了中间环节的参与和成本。\n需要注意的是，区块链技术也面临一些挑战，如可扩展性、能源消耗等问题，但随着技术的不断发展和创新，区块链有望在未来发挥更大的作用，改变各个行业的方式和模式。"},"区块链攻击":{"title":"区块链攻击","links":["共识攻击","桥接攻击","治理攻击","三明治攻击","区块链攻击","预言机攻击","先行交易攻击","池间过度套利","Eclipse-Attacks"],"tags":[],"content":"\n共识攻击\n桥接攻击\n治理攻击\n三明治攻击\n区块链攻击\n预言机攻击\n先行交易攻击\n池间过度套利\nEclipse Attacks\n"},"去中心化金融":{"title":"去中心化金融","links":[],"tags":[],"content":"去中心化金融（Decentralized finance，简称DeFi）是一种建立在区块链上的金融系统，它不依赖于传统金融机构如券商、交易所或银行等提供金融服务，而是通过智能合约（例如以太坊）实现金融活动。DeFi平台允许人们进行资金借贷、交易加密货币，并在类似储蓄账户的机制中获得利息。\n以下是DeFi与中心化金融（CeFi）的对比：\n特点：\n\nDeFi：去中心化，无需中心化机构控制\nCeFi：中心化，依赖中心化机构提供服务\n\n资金管理和控制：\n\nDeFi：用户自己掌握私钥和资金控制\nCeFi：用户将资金委托给中心化机构\n\n金融产品和服务：\n\nDeFi：提供多种去中心化金融产品和服务\nCeFi：提供传统金融产品和服务\n\n监管和合规性：\n\nDeFi：非中心化，没有中心化机构负责监管\nCeFi：依赖中心化机构的监管和合规性\n\n开放性和可访问性：\n\nDeFi：开放参与，任何人都可以使用和访问\nCeFi：需要通过平台的审核和注册\n\n隐私和安全性：\n\nDeFi：用户控制自己的资金和数据\nCeFi：依赖中心化机构保护资金和数据\n\n风险管理和保护：\n\nDeFi：需要用户自行管理和控制风险\nCeFi：依赖中心化机构的风险管理和保护\n\nDeFi的出现使得金融服务更加去中心化、开放和可访问，用户可以更好地掌控自己的财务。然而，DeFi也面临着一些挑战，如智能合约的安全性、监管合规性等问题，需要进一步发展和完善。"},"多签钱包":{"title":"多签钱包","links":[],"tags":[],"content":"多签钱包是一种加密货币钱包，需要多个签名来执行每个交易，而不仅仅是一个签名。这些签名与不同的加密私钥相关联，必须有一定数量的私钥对交易进行签名才能验证它的有效性。\n基本概念 §\n通常情况下，在区块链上只需要一个私钥来签署交易。然而，许多区块链（例如比特币所基于的区块链）允许创建需要多个私钥才能成功签署交易的地址。只有由地址指定的密钥才能使用（例如：在3-of-3钱包中，您的密钥、您配偶的密钥和您的安全公司的密钥）。存在许多不同的组合和用途：2-of-2、3-of-3、2-of-3，甚至1-of-2等。只有在使用所需数量的私钥时，才能创建签名并授权交易。这意味着，在大多数情况下，如果其中一个密钥被攻击，您的资产仍然是安全的。\n类型 §\n多签加密货币钱包可以根据现有私钥的数量和授权交易所需的签名数量进行区分。以下是个人钱包和加密货币交易所中常用的一些选项：\n\n2-of-2多签钱包：使用双因素身份验证功能保护的钱包使用2-of-2多签名算法。这种方法是将私钥存储在两个不同的设备上，例如一个私钥存储在计算机上，另一个私钥存储在移动设备上。只有两个设备都签署了交易，交易才能得到授权。这种方式增加了安全性，但如果其中一个设备被攻击，您可能会失去对资金的访问权。\n2-of-3多签钱包：这种类型的多签钱包需要使用3个现有私钥中的任意2个来授权交易。它们通常被交易所用于增强其热钱包的安全性。支持2-of-3多签地址的交易所将一个私钥在线保存，将第二个私钥离线保存在隔离设备上（有时称为“纸质”备份）。第三个私钥由另一个安全公司保存。由于有两个独立的实体负责私钥，如果其中一个被黑客攻击，钱包仍然是安全的。离线备份还可以在安全合作伙伴公司倒闭的情况下进一步保护热钱包。\n1-of-2多签钱包：多签钱包也可以用于在多个用户之间共享资金。如果您想与信任的人共享单个钱包中的资金使用权，您可以设置一个允许任何两个密钥都可以创建签名的钱包。但两个密钥都不是必需的，这意味着您们两个都可以独立操作资金。\n\n优势 §\n多签钱包需要多个私钥的授权，这意味着即使其中一个私钥被攻击，多签钱包是一种加密货币钱包，需要多个签名来执行每笔交易。这些签名与不同的加密私钥相关联，必须有一定数量的私钥对交易进行签名才能验证它的有效性。"},"工作量证明":{"title":"工作量证明","links":["拜占庭容错"],"tags":[],"content":"工作量证明（Proof of Work，简称PoW）是一种在区块链网络中达成共识的机制，用于确认交易并生成新的区块。它是比特币等加密货币的底层共识模型之一。工作量证明依赖于将电能转化为数字区块链的“权重”，从而构成了PoW区块链的不可伪造成本，并通过这个过程推动激励结构，形成了拜占庭容错（BFT）的分布式网络。\n工作量证明的机制可以通过观察比特币的中本聪共识来理解，它是成功且可持续的PoW实现的主要例子。在PoW机制中，矿工通过解决数学难题来获得一个低于特定阈值的值，用于生成下一个要添加到区块链网络中的区块。下一个区块的生成者是根据他们在解决过程中贡献的计算能力（即哈希）通过类似抽奖的方式选取的。这种机制确保了最长的链具有最多的工作量，从而可以轻松确定身份。\n在工作量证明的共识模型中，有两类主要参与者：矿工和全节点运营商。\n矿工是参与者市场，他们相互竞争来解决难题并生成下一个要添加到区块链网络中的区块。每10分钟左右，会有一个矿工获胜并获得区块奖励（目前为12.5 BTC）和区块内的交易费用。这种设计促使矿工保持诚实，因为他们需要购买昂贵的硬件设备并消耗大量电能进行计算。矿工以比特币而非现金形式获得奖励，这使得他们将现实世界的资源（电力）用于生产比特币，从而形成了比特币整个安全模型的基础。\n全节点运营商是第二类实体，他们运行全节点客户端来验证网络中的交易和区块，并进行广播。全节点运营商是网络的心脏，也是网络状态的最终验证者。他们使用加密证明和比特币共识规则来验证区块链上的交易和区块的有效性。\n需要注意的是，由于高能耗设计，工作量证明一直受到批评。然而，绝大多数比特币挖矿活动使用的是可再生能源，并且能源开销与比特币整体价值和财富创造之间取得平衡是一项复杂的任务。工作量证明是计算和博弈论设计的一项重大创新，它融合了博弈论激励、分布式计算、社会共识、市场经济学和加密证明的安全手段。比特币的成功运行已经证明了工作量证明的可行性和有效性。"},"拜占庭容错":{"title":"拜占庭容错","links":["区块链"],"tags":[],"content":"拜占庭容错（Byzantine Fault Tolerance，简称BFT）是一种针对分布式系统中存在故障节点或恶意行为的容错机制。它是为了解决拜占庭将军问题而提出的。\n拜占庭将军问题是一个协议问题，描述了拜占庭帝国军队的将军们必须全体一致地决定是否攻击某一支敌军的情景。问题在于这些将军在地理上是分隔开来的，并且将军中存在叛徒。叛徒可以任意行动以达到欺骗、迷惑或促成不一致的目的。为了取得胜利，将军们必须达成一致的决策，否则任何攻击行动都注定会失败。\n拜占庭容错算法是为了解决拜占庭将军问题而设计的一类算法。这些算法能够在存在故障节点或恶意行为的情况下，保证系统的安全性和活性。拜占庭容错系统的核心原则是少数服从多数，即只要大多数节点达成一致，系统就能正常运行。\n拜占庭容错系统需要满足以下两个指标：\n\n安全性：任何已经完成的请求都不会被更改，已生成的账本不可篡改，并且可以被节点随时查看。\n活性：系统可以接受并执行非拜占庭客户端的请求，不会受到任何因素的影响而导致非拜占庭客户端的请求无法执行。\n\n拜占庭容错系统的假设条件包括：\n\n拜占庭节点的行为可以是任意的，拜占庭节点之间可以共谋。\n节点之间的错误是不相关的。\n节点之间通过异步网络连接，网络中的消息可能丢失、乱序、延时到达。\n服务器之间传递的信息，第三方可以知晓，但不能窜改、伪造信息的内容和验证信息的完整性。\n\n拜占庭容错在区块链技术中具有重要意义，它能够保证区块链系统的安全性和可靠性，防止恶意节点对系统进行攻击或篡改数据。"},"智能合约":{"title":"智能合约","links":[],"tags":[],"content":"智能合约是一种自动执行合约条款的计算机程序，无需第三方的参与。智能合约的执行可以导致资金交换、服务交付、解锁受数字版权管理保护的内容或其他类型的数据操作，例如更改土地所有权证书上的名称。智能合约还可以用于执行隐私保护，例如通过促进有选择性地发布受隐私保护的数据以满足特定请求。\n智能合约的工作原理是基于“如果/当…那么…”语句。这些语句被编写成区块链上的代码，当满足并经网络中的计算机节点验证了预定条件时，合约中指定的操作就会被执行。创建智能合约的过程始于业务团队与开发人员合作，描述他们对智能合约在不同事件或情况下的期望行为。开发人员使用智能合约编写平台来开发逻辑并进行测试，以确保其按预期工作。合约编写完成后，需要进行安全审查，然后部署在现有的区块链或其他分布式账本基础设施上。一旦智能合约部署完成，它会配置为监听来自“预言机”的事件更新。预言机实际上是一个具有密码学安全的流式数据源。智能合约在接收到来自一个或多个预言机的适当事件组合后执行。\n智能合约最常用于供应链管理和知识产权等各个行业。智能合约通常使用区块链技术部署，区块链是一种分散的记录技术，可以保持交易的不可变性和安全性。虽然智能合约并不一定需要区块链，但由于其安全性和不可变性，区块链是存储智能合约的理想选择。智能合约数据在共享账本上进行加密，几乎不可能丢失存储在区块中的信息。区块链技术的灵活性是其被纳入智能合约的另一个优势。开发人员可以在区块链中存储几乎任何类型的数据，并且有多种交易选项可供选择。因此，基于区块链的智能合约有助于使交易和其他业务流程更安全、高效和具有成本效益，从而降低交易成本，并使各个行业受益。\n\n\nWhat are smart contracts on blockchain? | IBM\nWhat Are Smart Contracts on the Blockchain and How They Work\nWhat is a smart contract? | Definition from TechTarget\n"},"桥接攻击":{"title":"桥接攻击","links":[],"tags":[],"content":"Bridge attacks"},"池间过度套利":{"title":"池间过度套利","links":[],"tags":[],"content":"定义 §\n池间过度套利（Excessive arbitrage between pools）是指在去中心化交易所（DEX）中，利用不同流动性池之间的价格差异进行过度的套利交易，从而导致流动性的流失和网络的拥堵。\n流动性池是一种由两种或多种代币按照一定比例组成的资金池，用于提供DEX中的交易对的流动性。\n流动性池的价格是由池内的代币数量和比例决定的，而不是由市场供求决定的。因此，当市场价格发生变化时，流动性池的价格可能会与市场价格出现偏差，从而产生套利机会。\n\n套利=搬砖\n过度套利=超高强度搬砖\n\n套利原理 §\n套利者利用DEX中的批量交易功能，同时在多个流动性池中进行循环交易，从而获得利润。例如，假设有三种代币A、B、C，以及三个流动性池AB、BC、CA。套利者可以先用A代币在AB池中换取B代币，然后用B代币在BC池中换取C代币，最后用C代币在CA池中换回A代币。如果这个循环交易的收益大于交易费用，那么套利者就可以赚取差价。\n后果 §\n过度套利的后果可能有以下几种：\n\n\n流动性的流失：\n会导致流动性池中的代币数量和比例发生变化，从而影响流动性池的价格和深度。这可能会使流动性池的价格与市场价格更加偏离，从而吸引更多的套利者进入，形成恶性循环。流动性池的价格偏离也可能会使流动性提供者（LP）遭受无常损失（impermanent loss），即流动性池的收益低于单独持有代币的收益。这可能会使LP退出流动性池，从而降低流动性池的规模和吸引力。\n\n\n网络的拥堵：\n会占用大量的网络资源，例如交易费用、区块空间和计算能力 。这可能会导致网络的拥堵和延迟，从而影响其他用户的交易体验和效率 。网络的拥堵也可能会使交易费用上升，从而增加交易的成本和风险 。\n\n\n防范措施 §\n\n优化价格机制：DEX可以通过优化价格机制，使流动性池的价格更加贴近市场价格，从而减少套利机会。例如，Uniswap V3引入了活跃流动性的概念，允许LP自定义流动性的范围和密度，从而提高流动性的利用率和价格的精确度。\n限制批量交易：DEX可以通过限制批量交易的数量和频率，使Excessive arbitrage between pools变得更加困难和昂贵。例如，Balancer V2引入了一个防止循环交易的机制，即如果一个批量交易中包含两次或以上的相同交易对，那么这个批量交易将被拒绝。\n"},"治理攻击":{"title":"治理攻击","links":[],"tags":[],"content":"治理攻击（Governance Attack）是指攻击者利用合法手段获取投票权，并通过操纵协议来谋取自身利益的行为。这些攻击通常发生在无许可投票的web3项目中，攻击者可以通过购买代币等方式获取投票权，并利用这些权力来控制协议的决策过程。治理攻击可能会导致协议的不稳定和不公平，因此需要设计相应的机制来防止和应对这些攻击。\n治理攻击的实例包括：\n\nSteemit案例：Steemit是一个去中心化社交网络，其链上治理系统由20名见证者控制。攻击者通过购买大量代币来获取投票权，并试图控制见证者的选举过程，最终成功掌控了该网络的治理权力。\nBeanstalk案例：Beanstalk是一个稳定币协议，曾遭受Flashloan治理攻击。攻击者通过借贷获得大量治理代币，并通过恶意提案成功控制了该协议的资金储备。\n\n为了应对治理攻击，需要进行深思熟虑的机制设计。以下是一些应对治理攻击的方法：\n\n降低攻击的价值：通过限制攻击者可以获取的利益，可以减少攻击的动机。这可以通过设计合理的治理规则和机制来实现。\n增加获得投票权的成本：增加攻击者获取投票权所需的成本，可以降低攻击的可能性。例如，可以设置投票权的门槛或要求投票者锁定一定数量的代币。\n增加执行攻击的成本：增加攻击者执行攻击所需的成本，可以减少攻击的效果。例如，可以设置投票冷却期或限制投票者的投票频率。\n"},"质押证明":{"title":"质押证明","links":["工作量证明"],"tags":[],"content":"质押证明（Proff of Stake, PoS）是一种加密货币的共识机制，用于确保区块链网络的安全性和运作。它是一种替代传统的工作量证明（Proof of Work, PoW）机制的方法，通过锁定加密货币来获得奖励。质押证明旨在提供一种更节能、更环保的共识机制，同时降低网络的中心化程度。质押证明的基本原理是将一定数量的加密货币锁定在钱包中，以证明持有者对网络的贡献，并获得相应的奖励。"},"通道":{"title":"通道","links":["Layer2"],"tags":[],"content":"区块链的 Layer2 扩展解决方案：通道\n通道是一种扩展解决方案，允许两个参与方之间创建点对点通道，可以在链下（ Layer 2 ）进行无限量的交易，而只需将两笔交易提交到链上（第一层）。通道可以提高交易速度，减少网络拥堵、交易费用和交易延迟。\n以下是通道的两种常见类型：\n\n\n状态通道（State Channels）：状态通道用于在区块链网络上更新状态。\n\n例如，假设两个玩家想在以太坊区块链上玩井字游戏。\n首先，玩家们在以太坊主链上创建一个多重签名智能合约，其中包含井字游戏的规则、玩家信息和 1ETH 的奖金。\n然后，玩家们进入状态通道并开始游戏。\n每个玩家的每一步都会创建一个链下交易，\n存储在智能合约中。当有获胜者时，玩家们通过签署最终状态并将其提交到多重签名合约来关闭通道。\n合约的最终状态将存储在以太坊主链上，并将 1ETH 的奖金转移到获胜者账户上。\n\n\n\n支付通道（Payment Channels）：支付通道类似于状态通道，但仅处理支付。\n\n例如，比特币区块链使用的支付通道是闪电网络，以太坊区块链使用的支付通道是 Raiden。\n通道允许两个参与方之间创建点对点支付通道，双方可以在没有第一层参与的情况下无限制地相互转移资金。\n最终，当两个参与方决定结束交易时，他们可以关闭通道，将最终状态的交易记录在区块链的第一层上。\n\n\n\n通道的优点：\n\n提高交易速度。\n降低交易费用。\n可以进行微支付，例如购买咖啡等小额商品和服务。\n\n通道的局限性：\n\n参与方必须始终在线并使用私钥进行签名，这使得他们容易受到黑客攻击和盗窃的威胁。\n参与方必须在多重签名钱包中锁定一定数量的资金，以打开支付通道。将硬币保存在手机、服务器或个人电脑的热钱包中会增加在线攻击的风险，而冷钱包则不连接到互联网，更安全但不太方便。\n\n\n\nLayer 2 Blockchain scaling solutions: Channels, Sidechains, Rollups and Plasma (Part 16) | by Techskill Brew | Blockchain 101 by Techskill Brew | Medium\nEasy to understand Ethereum Layer 2 scaling solutions: Channels vs Plasma vs Rollups | by The Overpacker Journal | Coinmonks | Medium\nHosam Mahmoud on LinkedIn: 🎯 100 Days Blockchain Development - DAY 10 📅 Today I deployed my first…\n"},"铭文":{"title":"铭文","links":[],"tags":[],"content":"Web3 中的铭文（inscription）是指一种数字资产，它可以直接铭刻在区块链上。铭文是一种新型的基于区块链的资产，允许投资者创建和购买直接铭刻在比特币区块链上的非同质化代币（NFTs）。\n铭文是数字化的艺术品，它们属于比特币区块链。通过使用 ord 客户端将 sats（比特币的单位）与内容铭刻在一起，这些艺术品得以呈现，并可以通过 ordinals 浏览器进行探索。与其他数字资产不同，铭文不需要单独的代币、侧链或对比特币基础设施的任何修改。要创建一个铭文，可以将各种类型的内容（如图像、SVG、文本或 HTML）嵌入到一个铭文交易中。通常，内容存储在交易见证中，其中包括签名和其他验证数据。这使得交易能够提供授权证明的同时，也作为创意表达的容器。\n铭文与以太坊和其他以太坊虚拟机为基础的区块链上的 NFTs 有所不同。在以太坊上，NFTs 经常引用存储在星际文件系统（IPFS）上的离链数据。IPFS 是一个去中心化的文件存储系统，类似于区块链自己的硬盘，并且支持动态元数据。这意味着 NFT 项目可以通过更改元数据来提高单个 NFT 的图像质量。在某些情况下，持有者需要点击 OpenSea 上的“刷新元数据”按钮以获取新的高质量图像。而铭文的数据完全记录在链上，因此被认为是“完整”的数字艺术品，而不是 NFTs。此外，NFTs 通常包括创作者的版税，而数字艺术品则没有。铭文被认为是 NFTs 的技术进步，并且有潜力引起比特币的文化转变。"},"链下证明":{"title":"链下证明","links":["ZK","预言机"],"tags":[],"content":"链下证明是用于链下交易的实体或系统,它们可以在不直接涉及区块链的情况下为某些信息或操作提供证明。\n定义 §\n链下证明是生成和提供特定的操作或数据外部证明的组件或系统。这些证明用于验证链下交易或计算的正确性和真实性。\n作用 §\n链下证明在链下交易中发挥几个重要作用,包括:\n\n生成加密证明：链下证明可以生成加密证明,用于验证链下交易或计算的有效性和完整性。\n确保数据完整性：链下证明提供证据表明链下交易使用的数据未被篡改或修改。\n实现无需信任的验证：通过提供加密证明,链下证明允许参与者在不依赖于中心化机构的信任的情况下验证链下交易的正确性。\n提高可扩展性：链下证明有助于减轻块链的计算负担,实现某些计算或验证的链下执行,从而提高可扩展性。\n\n类型 §\n链下证明的类型取决于特定应用场景和需求。一些常见类型包括:\n\n零知识证明：使用零知识证明来证明一个语句的有效性而不披露任何额外信息。\n可信第三方证明：在某些情况下,可信的第三方可能会作为链下证明,提供某些操作或数据的证明。\n分散式预言机：分散式预言机网络也可以作为链下证明,提供外部来源的可靠和可验证数据。\n\n相关开源项目 §\n\n\nOffchain Labs: 构建可扩展的离链计算平台。\n\n\nCeler Network：提供高吞吐量和低延迟的离链支付和智能合约执行。\n\n\nRaiden Network: 离链支付通道网络，提供高吞吐量和低成本的离链交易。raiden-network/raiden: Raiden Network\n\n"},"闪电贷":{"title":"闪电贷","links":[],"tags":[],"content":"闪电贷（Flash Loan）是一种基于区块链的借贷方式，它允许用户在一笔交易中借入和归还大量的资产，而无需提供任何抵押或信用。闪电贷的特点是：\n\n速度快：闪电贷只在一个区块内完成借贷操作，所以称为闪电贷。如果借款人不能在同一个区块内归还借款，那么整个交易将被撤销，就像没有发生过一样 。\n风险低：闪电贷不需要任何抵押或信用，因为它是无条件的。借款人只要能在规定的时间内还款，就可以借到任意数量的资产 。如果用户无法在规定时间内还款，那么交易会被撤销，用户将损失交易费用和利息。出借方也不会损失任何资产 。\n用途广：闪电贷可以用于各种目的，例如套利、抵押、偿还债务、参与拍卖等 。闪电贷可以让用户利用市场的价格差异，实现无风险的利润 。\n\n闪电贷攻击 §\n原文：什么是DeFi中的闪电贷？ | Binance Academy\n我们将通俗地介绍。\n\n第一次：攻击者借了很多以太币，然后用一部分去卖空以太币，兑换了一种叫包装比特币WBTC的代币。这样一来，WBTC的价格就涨了很多。然后，攻击者又用剩下的以太币去借了更多的WBTC，再卖掉换成以太币。这样一来，攻击者就赚了很多钱，还了借的以太币，还剩下很多以太币。\n第二次：攻击者借了很多以太币，然后用一部分去买了一种叫sUSD的代币。这种代币本来应该和美元一样价值，但是因为攻击者买了很多，所以sUSD的价格就涨了一倍。然后，攻击者又用剩下的以太币去借了更多的以太币，因为他们有很多sUSD可以作为抵押。再然后，攻击者把借的以太币和买的sUSD都卖掉换成以太币。这样一来，攻击者也赚了很多钱，还了借的以太币，还剩下很多以太币。\n\n简单来说，就是攻击者利用借的钱去操纵市场，让一些代币的价格变得不合理，然后再利用这些价格差异来赚钱。\n闪电贷的漏洞主要是由于它可以提供大量的资金，从而放大了一些已有的合约漏洞或逻辑缺陷，导致了一系列的闪电贷攻击。作为开发者，需要注意以下几种常见的闪电贷漏洞：\n\n\n价格获取逻辑存在问题：一些合约直接读取了去中心化交易所（DEX）的代币数量，将两者之商作为代币的价格。这样的逻辑容易被闪电贷攻击者利用，通过借用大量的代币，操纵DEX的价格，从而实现双花或者套利。作为开发者，应该使用去中心化的预言机（oracle）来获取更可靠的价格信息，或者使用时间加权平均价格（TWAP）来抵消价格波动。\n\n\n抵押或奖励逻辑存在问题：一些合约在抵押或奖励的过程中，会立即将代币转给用户地址，而不进行任何校验或限制。这样的逻辑容易被闪电贷攻击者利用，通过借用大量的代币，重复调用抵押或奖励的函数，从而获得超额的收益。作为开发者，应该在抵押或奖励的过程中，增加一些条件或限制，例如检查用户的抵押率、奖励次数、奖励金额等。\n\n\n重入攻击：一些合约在执行闪电贷的过程中，会先转账后记账，或者先执行用户的回调函数后再进行校验。这样的逻辑容易被闪电贷攻击者利用，通过借用大量的代币，利用回调函数重复调用闪电贷的函数，从而实现多次借款或者不还款。作为开发者，应该在执行闪电贷的过程中，先进行校验后转账，或者使用互斥锁（mutex）来防止重入。\n\n"},"预言机":{"title":"预言机","links":["智能合约","DeFi"],"tags":[],"content":"定义 §\n预言机（oracle）是一种用于区块链的基础设施，用于将区块链与外部数据和系统进行交互。区块链本身无法直接连接到现实世界的数据和事件，因此需要预言机来作为桥梁，将外部数据引入区块链环境中。预言机的作用是将外部数据传递给智能合约，使其能够根据这些数据执行相应的操作。\n预言机解决了区块链的一个基本限制，即智能合约无法直接与其所在的区块链环境之外的数据和系统进行交互。通过与外部系统隔离，区块链获得了其最有价值的特性，如对用户交易有效性的强大共识、防止双重支付攻击以及减轻网络停机时间的能力。然而，许多智能合约的使用案例，如DeFi（去中心化金融），需要获取外部的实时数据和事件。预言机通过提供一个通用的接口，使区块链能够与外部资源进行安全互操作，同时保持区块链的安全性。\n分类 §\n预言机可以是中心化的或去中心化的。中心化预言机使用一个集中的实体来向智能合约提供数据，但这会引入单点故障的风险，违背了去中心化应用的初衷。去中心化预言机通过结合多个独立的预言机节点操作者和可靠的数据源来实现端到端的去中心化。这种多层次的去中心化方法可以消除单点故障的风险。\n预言机的类型包括输入预言机、输出预言机、跨链预言机和计算预言机。输入预言机从现实世界（链外）获取数据，并将其传递到区块链上的智能合约中。输出预言机允许智能合约向链外系统发送命令，触发执行特定的操作。跨链预言机可以在不同的区块链之间读取和写入信息，实现跨链互操作性。计算预言机使用安全的链外计算来提供区块链上无法实现的分散服务。\n应用 §\n预言机在许多领域都有应用，包括去中心化金融（DeFi）、动态非同质化代币和游戏、保险、企业应用和可持续发展等。它们扩展了区块链网络的能力，使其能够支持更多复杂的混合智能合约应用。\n相关开源项目 §\n\nChainlink: 市场上最大的区块链预言机之一，它为不同的基于区块链的解决方案提供链外数据。它在2019年以以太坊为基础推出，为不同的区块链平台提供链上服务。\nBand Protocol: 一个跨链预言机，基于 Cosmos 生态系统，为使用 BandChain 的智能合约提供防篡改的数据源。\nDecentralized Information Asset (DIA): 一个专为去中心化金融 (DeFi) 领域定制的开源预言机平台。它利用加密经济激励机制提供、共享和使用由多个参与者验证的透明价格数据。\nUniversal Market Access (UMA): 一个基于以太坊的预言机，为用户提供创建金融智能合约和合成资产的智能合约模板。它旨在将 DeFi 市场与现实世界桥接起来，并确保数据的完整性。\nXYO Network: 一个基于以太坊的预言机协议，利用分布式和匿名设备网络获取关于个体或物体地理位置的准确信息。\nTellor: 一个知名的区块链预言机，为跨不同行业的 dApp 提供链外数据访问。\n"},"预言机攻击":{"title":"预言机攻击","links":["预言机"],"tags":[],"content":"预言机攻击是一种针对区块链预言机的攻击，目的是操纵预言机提供的外部数据，从而影响智能合约的执行结果，实施套利或者破坏。预言机是指获取、验证外部信息（即存储在链下的信息）并将外部信息传送给在区块链上运行的智能合约的应用程序。预言机的作用是弥合区块链和外部环境之间的信息缺口，让智能合约可以使用链下数据触发功能或状态变化。\n常见的预言机攻击 §\n预言机攻击的方式有多种，主要取决于预言机的数据来源、信任模型和系统架构。一些常见的预言机攻击有：\n\n操纵数据源：攻击者可以通过向预言机所依赖的数据源发送错误或者恶意的数据，从而使预言机返回不正确或者不一致的数据，影响智能合约的逻辑或者计算。例如，攻击者可以利用闪电贷借入大量的资产，操纵去中心化交易所的价格，从而误导预言机的喂价，实现双花或者套利。\n拒绝服务：攻击者可以通过阻止或延迟预言机向智能合约发送数据，从而使智能合约无法正常执行或者触发状态变化。例如，攻击者可以利用网络拥塞或者恶意节点，干扰预言机的数据传输，实现拒绝服务或者共识操纵。\n腐败或勒索：攻击者可以通过贿赂或威胁预言机的运营者或者数据提供者，使他们提供错误或者有利的数据，从而影响智能合约的执行结果。例如，攻击者可以利用经济或者法律手段，诱导或强迫预言机的参与者合谋或背叛，实现利益分配或者资产转移。\n\n防御措施 §\n\n优化数据源：预言机可以通过优化数据源的选择，使数据更加可靠和多样化，从而减少操纵的可能性。例如，预言机可以从多个不同类型的数据源获取数据，例如中心化的应用程序接口、去中心化的交易所、去中心化的预言机等。\n引入验证机制：预言机可以通过引入验证机制，使数据更加准确和一致，从而减少错误的影响。例如，预言机可以使用密码学或者经济的方法，对数据的真实性和完整性进行证明，例如数字签名、零知识证明、抵押和惩罚等。\n增加激励兼容性：预言机可以通过增加激励兼容性，使数据更加公平和可信，从而减少腐败的风险。例如，预言机可以使用游戏论或者机制设计的方法，对数据的提供者进行奖励或惩罚，例如声誉系统、赏金计划、施勒定理等。\n总之，预言机攻击是一种利用预言机提供的外部数据进行操纵或破坏的攻击，可能会影响区块链的安全和稳定。预言机可以通过优化数据源、引入验证机制、增加激励兼容性等方法来防御这种攻击，从而提高数据的质量和信任度。\n"}}